ygoz/stm32h723zg_mg_rtos/Core/Src/flash/w25q128jvsq.c
#include <string.h>
#include <stdio.h>
#include "stm32h7xx_hal.h"
#include "serial_comm/spi/octospi.h"
#include "flash/w25q128jvsq.h"



static void ospi_command_default_init(OSPI_RegularCmdTypeDef *sCommand) {
    sCommand->OperationType             = HAL_OSPI_OPTYPE_COMMON_CFG;             // Common configuration (indirect or auto-polling mode)
    sCommand->FlashId                   = HAL_OSPI_FLASH_ID_1;                    // Use Flash ID 1
    sCommand->InstructionDtrMode        = HAL_OSPI_INSTRUCTION_DTR_DISABLE;       // Disable Instruction DDR/DTR Mode
    sCommand->AddressDtrMode            = HAL_OSPI_ADDRESS_DTR_DISABLE;           // Disable Address DDR/DTR Mode
    sCommand->DataDtrMode               = HAL_OSPI_DATA_DTR_DISABLE;              // Disable Data DDR/DTR Mode
    sCommand->DQSMode                   = HAL_OSPI_DQS_DISABLE;                   // Disable Data Strobe (DQS)
    sCommand->SIOOMode                  = HAL_OSPI_SIOO_INST_EVERY_CMD;           // Send instruction on every command
    sCommand->AlternateBytesMode        = HAL_OSPI_ALTERNATE_BYTES_NONE;          // No alternate bytes
    sCommand->AlternateBytes            = HAL_OSPI_ALTERNATE_BYTES_NONE;          // Alternate bytes = 0
    sCommand->AlternateBytesSize        = HAL_OSPI_ALTERNATE_BYTES_NONE;          // Size = 0
    sCommand->AlternateBytesDtrMode     = HAL_OSPI_ALTERNATE_BYTES_DTR_DISABLE;   // Disable alternate bytes DTR mode
    sCommand->InstructionMode           = HAL_OSPI_INSTRUCTION_1_LINE;            // Use 1 line for instruction
    sCommand->InstructionSize           = HAL_OSPI_INSTRUCTION_8_BITS;            // 8-bit instruction
    sCommand->AddressSize               = HAL_OSPI_ADDRESS_24_BITS;               // 24-bit address
}



/* OCTO SPI Initial Function */
HAL_StatusTypeDef W25Q128_OCTO_SPI_Init(OSPI_HandleTypeDef* hospi)
{
	if (HAL_OSPI_DeInit(hospi) != HAL_OK) {
	    return HAL_ERROR;
	}

	MX_OCTOSPI2_Init();

	if (W25Q128_OSPI_ResetChip(hospi) != HAL_OK) {
	    return HAL_ERROR;
	}
	if (W25Q128_OSPI_Configuration(hospi) != HAL_OK) {
        return HAL_ERROR;
    }
	HAL_Delay(1);
	if (W25Q128_OSPI_AutoPollingMemReady(hospi) != HAL_OK) {
        return HAL_ERROR;
    }
    if (W25Q128_OSPI_WriteEnable(hospi) != HAL_OK) {
        return HAL_ERROR;
    }
    return HAL_OK;
}

/* Reset Chip Function */
HAL_StatusTypeDef W25Q128_OSPI_ResetChip(OSPI_HandleTypeDef* hospi)
{
    OSPI_RegularCmdTypeDef sCommand={0};

    /* Enable Reset --------------------------- */
	/* Common Commands*/
    ospi_command_default_init(&sCommand);
	/* Instruction */
	sCommand.Instruction 				= W25Q_ENABLE_RST_CMD;						/* What We Do? */
	/* Address */
	sCommand.AddressMode       			= HAL_OSPI_ADDRESS_NONE;					/* Define Address Lines: No Address */
	sCommand.Address					= 0;										/* Byte Address */
	/* Data */
	sCommand.DataMode          			= HAL_OSPI_DATA_NONE;						/* Define Data Lines: No Data */
	sCommand.DummyCycles       			= 0;										/* Bytes Send With No Data */
	sCommand.NbData            			= 0;										/* Bytes Send With Data */

    if (HAL_OSPI_Command(hospi, &sCommand, HAL_OSPI_TIMEOUT_DEFAULT_VALUE) != HAL_OK) {
        return HAL_ERROR;
    }

    /* Reset Device --------------------------- */
	/* Common Commands*/
    ospi_command_default_init(&sCommand);
	/* Instruction */
	sCommand.Instruction 				= W25Q_RESET_CMD;							/* What We Do? */
	/* Address */
	sCommand.AddressMode       			= HAL_OSPI_ADDRESS_NONE;					/* Define Address Lines: No Address */
	sCommand.Address					= 0;										/* Byte Address */
	/* Data */
	sCommand.DataMode          			= HAL_OSPI_DATA_NONE;						/* Define Data Lines: No Data */
	sCommand.DummyCycles       			= 0;										/* Bytes Send With No Data */
	sCommand.NbData            			= 0;										/* Bytes Send With Data */

    if (HAL_OSPI_Command(hospi, &sCommand, HAL_OSPI_TIMEOUT_DEFAULT_VALUE) != HAL_OK) {
        return HAL_ERROR;
    }
    return HAL_OK;
}

/* Enable Quad Mode & Set Dummy Cycles Count */
HAL_StatusTypeDef W25Q128_OSPI_Configuration(OSPI_HandleTypeDef* hospi)
{
    uint8_t reg1=0, reg2=0, reg3=0;
    uint8_t w_reg1=0, w_reg2=0, w_reg3=0;

    if (W25Q128_Read_Status_Registers(hospi, &reg1, 1) != HAL_OK)
    {
        return HAL_ERROR;
    }

    if (W25Q128_Read_Status_Registers(hospi, &reg2, 2) != HAL_OK)
    {
        return HAL_ERROR;
    }

    if (W25Q128_Read_Status_Registers(hospi, &reg3, 3) != HAL_OK)
    {
        return HAL_ERROR;
    }

    // w_reg1 = reg1;
    // w_reg2 = reg2 | W25Q_SR_Quad_Enable;
    w_reg1 = 0;
    w_reg2 = W25Q_SR_Quad_Enable;
    w_reg3 = (reg3 & W25Q_SR_DRV1);

    if (W25Q128_Write_Status_Registers(hospi, w_reg1, 1) != HAL_OK)
    {
        return HAL_ERROR;
    }
    if (W25Q128_Write_Status_Registers(hospi, w_reg2, 2) != HAL_OK)
    {
        return HAL_ERROR;
    }

    if (W25Q128_Write_Status_Registers(hospi, w_reg3, 3) != HAL_OK)
    {
        return HAL_ERROR;
    }

        // Read again after write
    if (W25Q128_Read_Status_Registers(hospi, &reg1, 1) != HAL_OK)
        return HAL_ERROR;
    if (W25Q128_Read_Status_Registers(hospi, &reg2, 2) != HAL_OK)
        return HAL_ERROR;
    if (W25Q128_Read_Status_Registers(hospi, &reg3, 3) != HAL_OK)
        return HAL_ERROR;

    printf("Status Registers AFTER configuration:\r\n");
    printf("SR1: 0x%02X, SR2: 0x%02X, SR3: 0x%02X\r\n", reg1, reg2, reg3);

    return HAL_OK;
}

/* Write Enable Function */
HAL_StatusTypeDef W25Q128_OSPI_WriteEnable(OSPI_HandleTypeDef* hospi)
{
    OSPI_RegularCmdTypeDef sCommand;
    OSPI_AutoPollingTypeDef sConfig;

    /* Enable write operations ------------------------------------------ */
	/* Common Commands*/
    ospi_command_default_init(&sCommand);
	/* Instruction */
	sCommand.Instruction 				= W25Q_WRITE_ENABLE_CMD;					/* What We Do? */
	/* Address */
	sCommand.AddressMode       			= HAL_OSPI_ADDRESS_NONE;					/* Define Address Lines: No Address */
	sCommand.Address					= 0;										/* Byte Address */
	/* Data */
	sCommand.DataMode          			= HAL_OSPI_DATA_NONE;						/* Define Data Lines: No Data */
	sCommand.DummyCycles       			= 0;										/* Bytes Send With No Data */
	sCommand.NbData            			= 0;										/* Bytes Send With Data */

    if (HAL_OSPI_Command(hospi, &sCommand, HAL_OSPI_TIMEOUT_DEFAULT_VALUE) != HAL_OK) {
        return HAL_ERROR;
    }

	/* Common Commands*/
    ospi_command_default_init(&sCommand);
	/* Instruction */
	sCommand.Instruction 				= W25Q_READ_SR1_CMD;						/* What We Do? */
	/* Address */
	sCommand.AddressMode       			= HAL_OSPI_ADDRESS_NONE;					/* Define Address Lines: No Address */
	sCommand.Address					= 0;										/* Byte Address */
	/* Data */
	sCommand.DataMode          			= HAL_OSPI_DATA_1_LINE;						/* Define Data Lines: Data On a Single Line */
	sCommand.DummyCycles       			= 0;										/* Bytes Send With No Data */
	sCommand.NbData            			= 1;										/* Bytes Send With Data */

    if (HAL_OSPI_Command(hospi, &sCommand, HAL_OSPI_TIMEOUT_DEFAULT_VALUE) != HAL_OK) {
        return HAL_ERROR;
    }

