ygoz/stm32h723zg_mg_rtos/Core/Src/flash/w25q128jvsq.c
    /* Initialize Memory Mapped Command */
    sMemMappedCfg.TimeOutActivation 	= HAL_OSPI_TIMEOUT_COUNTER_DISABLE;		/* Timeout counter disabled, nCS remains active */

    if (HAL_OSPI_MemoryMapped(hospi, &sMemMappedCfg) != HAL_OK) {
        return HAL_ERROR;
    }

    return HAL_OK;
}

/* Check Chip is Busy Function */
HAL_StatusTypeDef W25Q128_IsBusy(OSPI_HandleTypeDef* hospi)
{
	HAL_StatusTypeDef state;
	uint8_t status_rgister = {0};

	state = W25Q128_Read_Status_Registers(hospi, &status_rgister, 1);
	if (state != HAL_OK)
		return state;

	status_rgister = status_rgister & 0b1;

	return status_rgister ? HAL_ERROR : HAL_OK;
}

/* Read Status Registers Function */
HAL_StatusTypeDef W25Q128_Read_Status_Registers(OSPI_HandleTypeDef* hospi, uint8_t* register_data, uint8_t register_num)
{
	OSPI_RegularCmdTypeDef sCommand={0};

	/* Common Commands*/
    ospi_command_default_init(&sCommand);
    /* Instruction */
    sCommand.Instruction 			= 0;										/* What We Do? */
    /* Address */
    sCommand.AddressMode       		= HAL_OSPI_ADDRESS_NONE;					/* Define Address Lines: No Address */
    sCommand.Address				= 0;										/* Byte Address */
    /* Data */
    sCommand.DataMode          		= HAL_OSPI_DATA_1_LINE;						/* Define Data Lines: Data On a Single Line */
    sCommand.DummyCycles       		= 0;										/* Bytes Send With No Data */
    sCommand.NbData            		= 1;										/* Bytes Send With Data */

	if (register_num == 1)
		sCommand.Instruction = W25Q_READ_SR1_CMD;
	else if (register_num == 2)
		sCommand.Instruction = W25Q_READ_SR2_CMD;
	else if (register_num == 3)
		sCommand.Instruction = W25Q_READ_SR3_CMD;
	else
		return HAL_ERROR;

    if (HAL_OSPI_Command(hospi, &sCommand, HAL_OSPI_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
    {
        return HAL_ERROR;
    }

    if (HAL_OSPI_Receive(hospi, register_data, HAL_OSPI_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
    {
        return HAL_ERROR;
    }

	return HAL_OK;
}

/* Write Status Registers Function */
HAL_StatusTypeDef W25Q128_Write_Status_Registers(OSPI_HandleTypeDef* hospi, uint8_t reg_data, uint8_t reg_num)
{
	OSPI_RegularCmdTypeDef sCommand;

	/* Common Commands*/
    ospi_command_default_init(&sCommand);
    /* Instruction */
    sCommand.Instruction 			= W25Q_WRITE_DISABLE_CMD;					/* What We Do? */
    /* Address */
    sCommand.AddressMode       		= HAL_OSPI_ADDRESS_NONE;					/* Define Address Lines: No Address */
    sCommand.Address				= 0;										/* Byte Address */
    /* Data */
    sCommand.DataMode          		= HAL_OSPI_DATA_NONE;						/* Define Data Lines: No Data */
    sCommand.DummyCycles       		= 0;										/* Bytes Send With No Data */
    sCommand.NbData            		= 0;										/* Bytes Send With Data */

	if (HAL_OSPI_Command(hospi, &sCommand, HAL_OSPI_TIMEOUT_DEFAULT_VALUE) != HAL_OK) {
		return HAL_ERROR;
	}
	if (W25Q128_OSPI_AutoPollingMemReady(hospi) != HAL_OK) {
        return HAL_ERROR;
    }

	sCommand.Instruction 			= W25Q_ENABLE_VOLATILE_SR_CMD;				/* What We Do? */
	if (HAL_OSPI_Command(hospi, &sCommand, HAL_OSPI_TIMEOUT_DEFAULT_VALUE) != HAL_OK) {
		return HAL_ERROR;
	}
	if (W25Q128_OSPI_AutoPollingMemReady(hospi) != HAL_OK) {
        return HAL_ERROR;
    }

	if (reg_num == 1)
		sCommand.Instruction = W25Q_WRITE_SR1_CMD;
	else if (reg_num == 2)
		sCommand.Instruction = W25Q_WRITE_SR2_CMD;
	else if (reg_num == 3)
		sCommand.Instruction = W25Q_WRITE_SR3_CMD;
	else
		return HAL_ERROR;

	sCommand.DataMode          		= HAL_OSPI_DATA_1_LINE;
	sCommand.NbData            		= 1;

	if (W25Q128_OSPI_WriteEnable(hospi) != HAL_OK) {
		return HAL_ERROR;
	}

	if (HAL_OSPI_Command(hospi, &sCommand, HAL_OSPI_TIMEOUT_DEFAULT_VALUE) != HAL_OK) {
		return HAL_ERROR;
	}
	if (HAL_OSPI_Transmit(hospi, &reg_data, HAL_OSPI_TIMEOUT_DEFAULT_VALUE) != HAL_OK) {
		return HAL_ERROR;
	}
	if (W25Q128_OSPI_AutoPollingMemReady(hospi) != HAL_OK) {
        return HAL_ERROR;
    }

	return HAL_OK;
}






void test_ext_flash(OSPI_HandleTypeDef *hospi) {
    static const uint32_t sectors_count = 256;
    static const uint32_t memory_sector_size = 1024 * 64;

    uint8_t buffer_test[memory_sector_size];  // Size must match memory_sector_size if static array
    uint32_t var = 0;

    // Initialize OSPI
    W25Q128_OCTO_SPI_Init(hospi);

    // Fill buffer with test data
    for (var = 0; var < memory_sector_size; var++) {
        buffer_test[var] = (var & 0xFF);
    }

    // Erase and write to each sector
    for (var = 0; var < sectors_count; var++) {
        printf("Writing sector %lu to address 0x%08lX\r\n", var, var * memory_sector_size);

        if (W25Q128_OSPI_EraseSector(hospi, var * memory_sector_size,
                                     (var + 1) * memory_sector_size - 1) != HAL_OK) {
            printf("Erase failed at sector %lu\r\n", var);
            while (1);  // Error
        }

        if (W25Q128_OSPI_Write(hospi, buffer_test, var * memory_sector_size, memory_sector_size) != HAL_OK) {
            printf("Write failed at sector %lu\r\n", var);
            while (1);  // Error
        }
    }

    // Enable memory-mapped mode
    if (W25Q128_OSPI_EnableMemoryMappedMode(hospi) != HAL_OK) {
        printf("Failed to enable memory-mapped mode\r\n");
        while (1); // Error
    }

    // Validate written data via memory-mapped access
    for (var = 0; var < sectors_count; var++) {
        uint8_t *flash_ptr = (uint8_t*)(0x70000000 + var * memory_sector_size);

        printf("\r\nChecking sector %lu at address 0x%08lX\r\n", var, (uint32_t)flash_ptr);
        printf("First 100 bytes:\r\n");
        for (int i = 0; i < 100; i++) {
            printf("%02X ", flash_ptr[i]);
            if ((i + 1) % 16 == 0) printf("\r\n");
        }

        if (memcmp(buffer_test, flash_ptr, memory_sector_size) != 0) {
            printf("\r\nMismatch at sector %lu (address 0x%08lX)\r\n", var, (uint32_t)flash_ptr);
            while (1);  // Error
        }
    }

    printf("\r\nQSPI memory check passed for %lu sectors.\r\n", sectors_count);
}
